Revit 2027 API
DXFExportOptions.GetPredefinedOptions Method
 Returns an instance DXFExportOptions containing settings from a predefined export setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DXFExportOptions GetPredefinedOptions(
	Document document,
	string setup
)
Public Shared Function GetPredefinedOptions (
	document As Document,
	setup As String
) As DXFExportOptions
public:
static DXFExportOptions^ GetPredefinedOptions(
	Document^ document,
	String^ setup
)
static member GetPredefinedOptions :
        document : Document *
        setup : string -> DXFExportOptions
Parameters
document Document
 A Revit project document to retrieve the setup from.
setup String
 The name of a predefined export setup from the specified document.
Return Value
DXFExportOptions
 An instance of predefined DXFExportOptions, or null if the name was not found.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DXFExportOptions Class
Autodesk.Revit.DB Namespace